app/views/users/_form.html.erb

    <%= f.label :group %><br />
	<%= collection_select(:user, :group_ids, Group.all, :id, :name,
		{ :selected => @user.group_ids },
		{:multiple => true, :group => 'user[group_ids][]' }) %>
---
SELECT "groups".id FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" IS NULL