app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 2
---
    	<div class="metaPost">
    		<%= post.comments.size%> comments - <%= post.created_at.to_s(:my_default_time)%>