app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2
---

<h3><%=@post.comments.size%> Comments</h3>