app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["body", "guest comment"], ["commenter", "test"], ["created_at", Fri, 25 Nov 2011 11:52:03 UTC +00:00], ["post_id", 5], ["updated_at", Fri, 25 Nov 2011 11:52:03 UTC +00:00], ["user_id", nil]]

  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "comments" SET "updated_at" = '2011-11-24 16:38:43.146383', "body" = 'test test test' WHERE "comments"."id" = 4