app/controllers/groups_controller.rb

  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 24 Nov 2011 17:45:31 UTC +00:00], ["description", "admin"], ["name", "admin"], ["updated_at", Thu, 24 Nov 2011 17:45:31 UTC +00:00]]

  def update
    @group = Group.find(params[:id])

    respond_to do |format|
      if @group.update_attributes(params[:group])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "groups" SET "updated_at" = '2011-11-24 18:09:55.256392', "description" = 'moderator', "name" = 'moderator' WHERE "groups"."id" = 3