app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id], :include => :comments)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (5)
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @post = current_user.posts.create(params[:post])
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test test test"], ["created_at", Sun, 13 Nov 2011 20:07:50 UTC +00:00], ["name", "my name"], ["title", "my title"], ["updated_at", Sun, 13 Nov 2011 20:07:50 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "content" = 'test sd', "updated_at" = '2011-11-13 20:56:58.559805' WHERE "posts"."id" = 2