app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "email", "password_salt", "persistence_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = 'loic@mail.com', "updated_at" = '2011-11-24 12:12:29.542039' WHERE "users"."id" = 1
---
  def update
    params[:user][:group_ids] ||= []
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])